{
  "app_title": "FODMAP диета",
  "app_label": "FODMAP список",
  "texts": {
    "home_title": "FODMAP продукты",
    "tab_favorites": "Избранное",
    "tab_all_products": "Все продукты",
    "search_label": "Поиск продуктов питания или категории",
    "search_hint": "например, яблоки, фрукты, молочные продукты...",
    "category_filter_label": "Категория продукта",
    "all_categories": "Все категории",
    "fodmap_level_filter_label": "Уровень FODMAP",
    "all_levels": "Все уровни",
    "add_product_button": "Добавить продукт",
    "empty_favorites_title": "Избранных продуктов пока нет",
    "empty_favorites_subtitle": "Нажмите на иконку звезды у продукта, чтобы добавить его в избранное.",
    "empty_search_title": "Продукты не найдены",
    "empty_search_subtitle": "Попробуйте другой поисковый запрос.",
    "tooltip_info": "Информация о FODMAP",
    "tooltip_backup": "Резервное копирование",
    "product_deleted": "Продукт \"%s\" удален",
    "undo": "Отменить",
    "load_error": "Не удалось загрузить продукты: %s",
    "save_error": "Не удалось сохранить избранное: %s",
    "delete_error": "Не удалось удалить продукт: %s",
    "backup_title": "Резервное копирование",
    "export_title": "Экспорт данных",
    "export_description": "Сохраните вашу базу данных продуктов в файл. Вы можете использовать его для восстановления или переноса на другое устройство.",
    "export_button": "Экспортировать JSON",
    "import_title": "Импорт данных",
    "import_description": "Загрузите ранее экспортированный файл JSON, чтобы заменить текущую базу данных.",
    "import_button": "Импортировать JSON",
    "export_success": "Данные успешно экспортированы в: %s",
    "export_cancelled": "Экспорт отменён.",
    "import_success": "Данные успешно импортированы из: %s",
    "import_cancelled": "Импорт отменён.",
    "import_warning": "Внимание: Импорт данных полностью заменит текущую базу данных. Убедитесь, что у вас есть актуальная резервная копия.",
    "info": {
      "title": "О FODMAP-диете",
      "section_what_is_fodmap": "Что такое FODMAP",
      "what_is_fodmap_content": "FODMAP — это аббревиатура от Fermentable Oligosaccharides, Disaccharides, Monosaccharides and Polyols (ферментируемые олиго-, ди-, моносахариды и полиолы), группа короткоцепочечных углеводов, которые плохо всасываются в тонком кишечнике. Они провоцируют симптомы СРК (синдром раздраженного кишечника) и служат «пищей» для бактерий при СИБР (синдром избыточного бактериального роста).",
      "section_polysaccharides": "Полисахариды в FODMAP",
      "fodmap_type_fructans_name": "Фруктаны и ГОС (олигосахариды)",
      "fodmap_type_fructans_desc": "Содержатся в пшенице, луке, чесноке, бобовых. Не расщепляются в тонкой кишке, ферментируются в толстой кишке → газ, вздутие.",
      "fodmap_type_lactose_name": "Лактоза (дисахарид)",
      "fodmap_type_lactose_desc": "Молочные продукты. При недостатке лактазы не всасывается → осмотическая диарея, метеоризм.",
      "fodmap_type_fructose_name": "Фруктоза (моносахарид)",
      "fodmap_type_fructose_desc": "Мёд, яблоки, груши. При избытке над глюкозой плохо всасывается → притягивает воду, ускоряет транзит.",
      "fodmap_type_polyols_name": "Полиолы (сорбит, маннит, ксилит)",
      "fodmap_type_polyols_desc": "Косточковые фрукты, грибы, подсластители. Медленно всасываются → осмотический эффект и ферментация в толстом кишечнике.",
      "fodmap_types_summary": "Все FODMAP объединяет: плохое всасывание в тонком кишечнике и быстрая ферментация бактериями в толстом кишечнике с образованием газа и короткоцепочечных жирных кислот.",
      "section_stress_life": "Стресс, болезнь и смена образа жизни: влияние на ЖКТ",
      "stress_content": "Стресс. Кишечник и мозг связаны осью «мозг-кишечник»: нервы, гормоны и вещества микрофлоры постоянно обмениваются сигналами. Хронический стресс меняет состав микробиоты (дисбактериоз), повышает проницаемость кишечной стенки и усиливает воспаление. У людей с СРК стресс часто обостряет боль, вздутие и нарушения стула. До трети пациентов с СРК имеют тревогу или депрессию. Поэтому при возвращении симптомов на фоне стресса полезны не только диета, но и релаксация, достаточный сон и при необходимости работа с психологом.",
      "illness_content": "Болезнь. Кишечные инфекции (гастроэнтерит) — один из главных факторов риска развития СРК: у примерно 10% переболевших возникает постинфекционный СРК даже после того, как возбудитель устранён. Инфекция меняет состав микробиоты и может нарушить моторику и чувствительность кишечника. Любая серьёзная болезнь, приём антибиотиков или операция могут спровоцировать обострение. В таких случаях временное возвращение к фазе ограничения FODMAP помогает снизить нагрузку на кишечник.",
      "lifestyle_content": "Смена образа жизни. Переезд, путешествия, смена работы или режима дня нарушают привычный режим питания, сна и активности. Сбивается график приёмов пищи, меняется доступность привычных продуктов — всё это может вызвать обострение. Смена часовых поясов и непривычная еда в поездках часто провоцируют симптомы. Рекомендуется заранее планировать питание, по возможности сохранять привычный режим и при необходимости кратко ужесточить диету до стабилизации состояния.",
      "section_intestine": "Что происходит в кишечнике при высоком FODMAP",
      "intestine_content": "С точки зрения гастроэнтерологии: в тонкой кишке FODMAP создают осмотическое давление — притягивают воду в просвет, что ускоряет транзит и может вызывать диарею. В толстой кишке непереваренные углеводы служат субстратом для бактерий: при ферментации образуются водород, метан, углекислый газ и короткоцепочечные жирные кислоты. Газ растягивает стенку кишки; у людей с висцеральной гиперчувствительностью (характерной для СРК) даже нормальное растяжение воспринимается как боль. Снижение FODMAP уменьшает объём ферментации и газообразования, что облегчает симптомы.",
      "section_ibs_sibo": "FODMAP, СРК и СИБР",
      "ibs_content": "СРК (синдром раздражённого кишечника) — функциональное расстройство с болью в животе и изменением стула. Исследования показывают, что FODMAP диета значительно улучшает общие симптомы СРК, особенно вздутие и консистенцию стула.",
      "sibo_content": "СИБР (избыточный бактериальный рост в тонкой кишке) — состояние, при котором в тонкой кишке слишком много бактерий. FODMAP служат им субстратом для ферментации прямо в тонкой кишке, что усиливает газообразование и симптомы. FODMAP диета уменьшает доступный субстрат и помогает контролировать симптомы СИБР, часто в сочетании с антибиотиками (например, рифаксимином).",
      "doctor_warning": "Важно: диета не заменяет консультацию врача. При подозрении на СРК или СИБР обратитесь к гастроэнтерологу.",
      "section_how_to_use": "Как пользоваться диетой. Безопасная порция",
      "diet_purpose": "Смысл диеты FODMAP заключается во временном исключении трудноусваиваемых углеводов для снижения процессов брожения в кишечнике. Это диагностический протокол, помогающий уменьшить боли, вздутие и диарею при синдроме раздраженного кишечника (СРК) или СИБР, выявляя индивидуальные продукты-триггеры.",
      "diet_stages_title": "Диета проводится в три этапа:",
      "diet_stage_1": "Ограничение (2–6 недель): исключение продуктов с высоким FODMAP",
      "diet_stage_2": "Восстановление: постепенное введение продуктов по группам для выявления переносимости",
      "diet_stage_3": "Персонализация: составление индивидуального рациона с учётом переносимых продуктов",
      "safe_portion": "Безопасная порция — это количество продукта, которое обычно не вызывает симптомов. В приложении для каждого продукта указаны стандартная и безопасная порции. Начинайте с малых количеств и увеличивайте постепенно, отслеживая реакцию организма.",
      "section_results": "Результат диеты: ЖКТ, самочувствие и микрофлора",
      "results_content": "При успешном соблюдении FODMAP диеты уменьшаются вздутие, боль в животе, метеоризм и нарушения стула. Улучшается общее самочувствие: меньше дискомфорта, нормализуется сон и повседневная активность.",
      "microbiome_content": "Микрофлора кишечника: на этапе ограничения может снижаться количество бифидобактерий и меняться состав микробиоты. Поэтому важны этапы восстановления и персонализации — постепенное введение переносимых FODMAP помогает вернуть разнообразие бактерий. Исследования показывают, что персонализированная диета (с включением переносимых продуктов) сохраняет улучшение симптомов и при этом поддерживает достаточную численность бифидобактерий в долгосрочной перспективе.",
      "repeat_diet_content": "Нужно ли соблюдать или повторять диету? Строгое ограничение FODMAP — временная мера (обычно 2–6 недель). Далее формируется индивидуальный рацион: вы включаете продукты, которые переносите, и ограничиваете только те, что вызывают симптомы. Такой режим часто можно соблюдать долго без жёстких ограничений. При возвращении симптомов (стресс, болезнь, смена образа жизни) можно кратко вернуться к фазе ограничения, а затем снова провести восстановление. Диету не нужно повторять циклически без причины — цель в том, чтобы найти свой персональный уровень переносимости.",
      "section_sources": "Источники данных о продуктах",
      "sources_intro": "База продуктов основана на открытых данных из репозитория zarhaselene/fodmap-recipe. Исходный файл (англ.):",
      "sources_url": "https://github.com/zarhaselene/fodmap-recipe/blob/main/public/fodmap.json",
      "sources_footer": "Данные переведены на русский язык. Вы можете добавлять и редактировать продукты в приложении. Официальный научный источник — база Monash University (monashfodmap.com), но она платная."
    },
    "result": {
      "title": "Информация о продукте",
      "tooltip_edit": "Редактировать",
      "product_not_found": "Продукт не найден в базе данных.",
      "portion_section_title": "Размер порции",
      "portion_standard": "Стандартная",
      "portion_safe": "Безопасная",
      "fodmap_type_section_title": "Тип FODMAP",
      "alternatives_section_title": "Альтернативы с низким FODMAP",
      "dietary_restrictions_title": "Диетические ограничения",
      "no_data": "Нет данных",
      "gluten_free": "Gluten-Free",
      "lactose_free": "Lactose-Free",
      "dairy_free": "Dairy-Free",
      "vegan": "Vegan",
      "vegetarian": "Vegetarian",
      "fodmap_type_fructose": "Фруктоза",
      "fodmap_type_lactose": "Лактоза",
      "fodmap_type_fructans": "Фруктаны",
      "fodmap_type_galactans": "Галактаны",
      "fodmap_type_polyols": "Полиолы"
    }
  },
  "settings": {
    "fodmap_levels": ["Все уровни", "Низкий", "Умеренный", "Высокий", "Неизвестно"],
    "snack_bar_undo_duration_seconds": 5
  }
}
